In [1]:
import pandas as pd
from sqlalchemy import create_engine
import warnings
import numpy as np

warnings.filterwarnings("ignore")

/var/folders/lk/mcqlnwdj19b1wj09y1h_xf0c0000gn/T/ipykernel_30207/3620706049.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
# Предварительно необходимо создать БД hw3:
postgres_str = f'postgresql://postgres:geheim@localhost:5432/hw3'
cnx = create_engine(postgres_str)

In [3]:
customer_df = pd.read_csv("../data/customer.csv", sep=";")
transaction_df = pd.read_csv("../data/transaction.csv", sep=";", decimal=",")
customer_df.rename(columns={'DOB': 'dob'}, inplace=True)

In [4]:
from sqlalchemy.sql import text

tables_ddl = {
    "customer": """
        CREATE TABLE customer (
            customer_id int primary key,
            first_name varchar(50),
            last_name varchar(50),
            gender varchar(30),
            DOB varchar(50),
            job_title varchar(50),
            job_industry_category varchar(50),
            wealth_segment varchar(50),
            deceased_indicator varchar(50),
            owns_car varchar(30),
            address varchar(50),
            postcode varchar(30),
            state varchar(30),
            country varchar(30),
            property_valuation int
        )""",
    "transaction": """
        CREATE TABLE transaction (
            transaction_id int primary key,
            product_id int,
            customer_id int,
            transaction_date varchar(30),
            online_order varchar(30),
            order_status varchar(30),
            brand varchar(30),
            product_line varchar(30),
            product_class varchar(30),
            product_size varchar(30),
            list_price float,
            standard_cost float
        )
    """
}
with cnx.connect() as conn:
    for tbl_name, create_q in tables_ddl.items():        
        conn.execute(text(f"DROP TABLE IF EXISTS {tbl_name}"))
        conn.execute(text(create_q))
    conn.commit()

In [5]:
customer_df.to_sql("customer", con=cnx, index=False, if_exists="append")
transaction_df.to_sql("transaction", con=cnx, index=False, if_exists="append")

1000

In [6]:
# 1. Вывести распределение (количество) клиентов по сферам деятельности, отсортировав результат по убыванию количества.

occ_df = pd.read_sql_query("""
    SELECT job_industry_category, count(*) as cnt
    FROM customer
    GROUP BY job_industry_category
    ORDER BY cnt DESC
""", cnx)
occ_df

  job_industry_category  cnt
0         Manufacturing  799
1    Financial Services  774
2                  None  656
3                Health  602
4                Retail  358
5              Property  267
6                    IT  223
7         Entertainment  136
8           Argiculture  113
9    Telecommunications   72

In [7]:
# 2. Найти сумму транзакций за каждый месяц по сферам деятельности, отсортировав по месяцам и по сфере деятельности.

tx_sum_df = pd.read_sql_query("""
    SELECT 
        date_trunc('month', to_date(transaction_date, 'DD.MM.YYYY')) as month,
        job_industry_category,
        sum(list_price) as tx_sum
    FROM transaction t
    INNER JOIN customer c ON t.customer_id = c.customer_id
    GROUP BY month, job_industry_category
    ORDER BY month, job_industry_category
""", cnx)
tx_sum_df

                        month job_industry_category     tx_sum
0   2017-01-01 00:00:00+00:00           Argiculture   43513.82
1   2017-01-01 00:00:00+00:00         Entertainment   64089.92
2   2017-01-01 00:00:00+00:00    Financial Services  366383.71
3   2017-01-01 00:00:00+00:00                Health  286860.38
4   2017-01-01 00:00:00+00:00                    IT  107783.37
..                        ...                   ...        ...
115 2017-12-01 00:00:00+00:00         Manufacturing  319248.23
116 2017-12-01 00:00:00+00:00              Property  117263.20
117 2017-12-01 00:00:00+00:00                Retail  153369.72
118 2017-12-01 00:00:00+00:00    Telecommunications   25852.57
119 2017-12-01 00:00:00+00:00                  None  300793.18

[120 rows x 3 columns]

In [8]:
# 3. Вывести количество онлайн-заказов для всех брендов в рамках подтвержденных заказов клиентов из сферы IT

it_count_df = pd.read_sql_query("""
    SELECT count(*)
    FROM transaction t
    INNER JOIN customer c ON t.customer_id = c.customer_id
    WHERE online_order = 'true' AND order_status = 'Approved' AND job_industry_category = 'IT'
""", cnx)
it_count_df

   count
0    540

In [9]:
# 4. Найти по всем клиентам сумму всех транзакций (list_price), максимум, минимум и количество транзакций, 
# отсортировав результат по убыванию суммы транзакций и количества клиентов. 
# Выполните двумя способами: используя только group by и используя только оконные функции. Сравните результат.

# 4.1 GROUP BY

df = pd.read_sql_query("""
    SELECT 
        c.customer_id, c.first_name, c.last_name,
        sum(list_price) as total, 
        max(list_price) as max, 
        min(list_price) as min, 
        count(*) as tx_count 
    FROM transaction t
    INNER JOIN customer c ON t.customer_id = c.customer_id
    GROUP BY c.customer_id
    ORDER BY total DESC, tx_count DESC
""", cnx)
df

      customer_id first_name last_name     total      max      min  tx_count
0            2183     Jillie    Fyndon  19071.32  2005.66   230.91        14
1            1129    Hercule      None  18349.27  1992.93   290.62        13
2            1597     Jeffry    Slowly  18052.68  2091.47   360.40        12
3             941        Tye    Doohan  17898.46  2091.47  1057.51        10
4            2788   Melantha  Pickburn  17258.94  2083.94   183.86        11
...           ...        ...       ...       ...      ...      ...       ...
3488         2423      Lenci    Symcox    202.62   202.62   202.62         1
3489         3189     Abbott    Knaggs    200.70   100.35   100.35         2
3490         2274       Nada   Reinert    142.98    71.49    71.49         2
3491         2532      Milli   Hubbert     71.49    71.49    71.49         1
3492         3292     Hamlen  Slograve     60.34    60.34    60.34         1

[3493 rows x 7 columns]

In [10]:
# 4.2 WINDOW
df = pd.read_sql_query("""
    SELECT 
        c.customer_id, c.first_name, c.last_name,
        sum(list_price) OVER cw as total,
        max(list_price) OVER cw as max, 
        min(list_price) OVER cw as min, 
        count(*) OVER cw as tx_count 
    FROM transaction t    
    INNER JOIN customer c ON t.customer_id = c.customer_id
    WINDOW cw AS (PARTITION BY c.customer_id)
    ORDER BY total DESC, tx_count DESC
""", cnx)
df

       customer_id first_name last_name     total      max     min  tx_count
0             2183     Jillie    Fyndon  19071.32  2005.66  230.91        14
1             2183     Jillie    Fyndon  19071.32  2005.66  230.91        14
2             2183     Jillie    Fyndon  19071.32  2005.66  230.91        14
3             2183     Jillie    Fyndon  19071.32  2005.66  230.91        14
4             2183     Jillie    Fyndon  19071.32  2005.66  230.91        14
...            ...        ...       ...       ...      ...     ...       ...
19992         3189     Abbott    Knaggs    200.70   100.35  100.35         2
19993         2274       Nada   Reinert    142.98    71.49   71.49         2
19994         2274       Nada   Reinert    142.98    71.49   71.49         2
19995         2532      Milli   Hubbert     71.49    71.49   71.49         1
19996         3292     Hamlen  Slograve     60.34    60.34   60.34         1

[19997 rows x 7 columns]

In [11]:
# 5. Найти имена и фамилии клиентов с минимальной/максимальной суммой транзакций за весь период (сумма транзакций не может быть null). 
# Напишите отдельные запросы для минимальной и максимальной суммы.

# 5.1 MIN
df = pd.read_sql_query("""
    WITH totals AS (
        SELECT
            customer_id,
            sum(list_price) as total
        FROM transaction
        GROUP BY customer_id
    )
    SELECT 
        first_name, last_name, total
    FROM customer c
    INNER JOIN totals t ON t.customer_id = c.customer_id
    WHERE t.total = (SELECT MIN(total) FROM totals)
""", cnx)
df

  first_name last_name  total
0     Hamlen  Slograve  60.34

In [12]:
# 5.2 MAX
df = pd.read_sql_query("""
    WITH totals AS (
        SELECT
            customer_id,
            sum(list_price) as total
        FROM transaction
        GROUP BY customer_id
    )
    SELECT 
        first_name, last_name, total
    FROM customer c
    INNER JOIN totals t ON t.customer_id = c.customer_id
    WHERE t.total = (SELECT MAX(total) FROM totals)
""", cnx)
df

  first_name last_name     total
0     Jillie    Fyndon  19071.32

In [13]:
# 6. Вывести только самые первые транзакции клиентов. Решить с помощью оконных функций.
df = pd.read_sql_query("""
    WITH rnk_tx AS (
        SELECT
            *,
            rank() OVER (PARTITION BY customer_id ORDER BY to_date(transaction_date, 'DD.MM.YYYY')) as rnk
        FROM transaction
    )
    SELECT 
        *
    FROM rnk_tx
    WHERE rnk = 1
""", cnx)
df

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,rnk
0,9785,72,1,05.01.2017,false,Approved,Norco Bicycles,Standard,medium,medium,360.40,270.30,1
1,2261,1,2,04.05.2017,true,Approved,Giant Bicycles,Standard,medium,medium,1403.50,954.82,1
2,10302,33,3,23.02.2017,false,Approved,Giant Bicycles,Standard,medium,small,1311.44,1167.18,1
3,12441,95,4,03.04.2017,false,Approved,Giant Bicycles,Standard,medium,large,569.56,528.43,1
4,2291,23,5,03.03.2017,true,Approved,Norco Bicycles,Mountain,low,small,688.63,612.88,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
3515,8276,18,3497,01.09.2017,true,Approved,Solex,Standard,medium,medium,575.27,431.45,1
3516,13469,12,3498,03.02.2017,true,Approved,WeareA2B,Standard,medium,medium,1231.15,161.60,1
3517,2794,62,3499,12.01.2017,false,Approved,Solex,Standard,medium,medium,478.16,298.72,1
3518,6309,69,3500,09.01.2017,true,Approved,Giant Bicycles,Road,medium,medium,792.90,594.68,1
3519,17469,0,5034,03.01.2017,false,Approved,OHM Cycles,Road,medium,medium,742.54,667.40,1

In [14]:
# 7. Вывести имена, фамилии и профессии клиентов, между транзакциями которых был максимальный интервал (интервал вычисляется в днях)

df = pd.read_sql_query("""
    with tx_dates as (
    	select
    		customer_id,
    		to_date(transaction_date, 'DD.MM.YYYY') as tx_date
    	from transaction
    ),
    tx_intervals as (
    	SELECT
    	    customer_id,
    	    tx_date,
    	    LAG(tx_date) OVER (PARTITION BY customer_id ORDER BY tx_date) AS prev_tx_date,
    	    tx_date - LAG(tx_date) OVER (PARTITION BY customer_id ORDER BY tx_date) AS interval_days
    	FROM tx_dates
    ),
    max_intervals as (
    	select customer_id, max(interval_days) as max_interval
    	from tx_intervals
    	where interval_days is not null
    	group by customer_id
    	order by max_interval desc
    )
    select c.first_name, c.last_name, c.job_title, mx.max_interval
    from customer c
    inner join max_intervals mx on mx.customer_id = c.customer_id 
    where max_interval = (select max(max_interval) from max_intervals)
""", cnx)
df

  first_name last_name        job_title  max_interval
0  Susanetta      None  Legal Assistant           357